print("---------------------------------")
a = int(input("Введите коэффициент а: "))
b = int(input("Введите коэффициент b: "))
c = int(input("Введите коэффициент c: "))
D = b ** 2 - 4 * a * c
print("Дискриминант равен: ", D)

if D < 0:
    print("Корней нет")
elif D == 0:
    print("Корни квадратного кравнения совпадают и равны: \nx = ", -b / (2 * a))
else:
    print("Корни уравнения равны: \nx1 = ", (-b + D ** 0.5) / (2 * a), "\nx2 = ", (-b - D ** 0.5) / (2 * a))

print("---------------------------------", end="")
